import styled from 'styled-components';
import Page from '../../components/page';

const WrapDiv = styled.div`
  font-size:12px;
  max-width:1024px;
  padding:20px 12px;
  box-sizing:border-box;
  margin:0 auto;
  color:#666;
  div,p {
    line-height:150%;
  }
  p {
    margin:4px 0;
  }
  table,table tr th, table tr td {
    border:1px solid #ccc;
    border-collapse: collapse;
  }
  table {
    width:100%;
    text-align:center;
    margin:6px 0;
    td {
      padding:6px 10px;
      box-sizing:border-box;
    }
    &.tb-one {
      td{
        width: auto;
        &:first-child {
          width: 25%;
        }
      }
    }
    &.tb-two {
      td {
        width: 25%;
      }
    }
    &.tb-thr {
      td {
        width: 20%;
      }
      .empty-content {
        td {
          padding: 20px 0;
        }
      }
    }
  }
  .TitleH {
    font-size:24px;
    font-weight:bold;
    color:#333;
    text-align:center;
  }
  .OneLeve {
    font-size:20px;
  }
  .TwoLeve {
    font-size:16px;
    color:#333;
    font-weight:bold;
    padding:8px 0;
  }
  .ThrLeve {
    font-size:14px;
    color:#333;
    font-weight:bold;
    padding:4px 0;
  }
  .IndentP {
    text-indent:24px;
  }
`;

const CreditAssignment =()=>(
  <Page title="债权转让协议">
    <WrapDiv>
      <div className="TitleH">债权转让协议</div>
      <div>
        <div className="TwoLeve">重要提示：</div>
        <p className="IndentP">
          如您已经通过上海吾悠互联网科技服务有限公司（下称“吾悠”）
          运营管理的领投鸟网络借贷平台（网址：www.lingtouniao.com,下称“本网站”）成功出借资金且与资金借入方建立了
          民间借贷关系而意欲将您所持有债权有偿转让给他人，
          您即为本协议的转让方。
        </p>
        <p className="IndentP">
          如您意欲从其他资金借出方有偿受让债权，
          则您即为本协议的受让方。在此情形下，您须事先在本网站设立平台账户和保存相应资金额度。
        </p>
        <p className="IndentP">
          本协议为电子文本合同，您在本网站进行债权转让操作前应阅读和知晓本协议全部内容，
          您进行下一步操作即视为您以及阅读并同意本协议条款且愿意受其约束和按其约定进行相关交易。
        </p>
        <p className="IndentP">
          本协议的转让方与受让方均确认，
          自主交易、自担风险，吾悠不对转让双方及债务人的信息真实性和还款能力、履约能力提供任何保证或其他责任。
        </p>
      </div>
      <div>
        <div className="TwoLeve">协议正文：</div>
        <p className="IndentP">
          本协议由以下债权转让方和债权受让方签署，旨在由转让方向受让方转让本协议约定的债权；同时，吾悠作为转让双方的居间服务人和交易管理方亦同时作为本协议一方，
          但不对转让双方或其中任何一方承担保证或连带责任。
        </p>
        <table className="tb-one">
          <tbody>
            <tr>
              <td className="set-width">债权转让方（网站用户名）</td>
              <td></td>
            </tr>
            <tr>
              <td className="set-width">债权转让方（网站用户名）</td>
              <td></td>
            </tr>
          </tbody>
        </table>
      </div>
      {/* <div>
        <div className="TwoLeve">1.标的债权</div>
        <p>1.1&nbsp;标的债权的债务人（即资金借入方）的相关情况，见下表标的债权信息中的资金借入方信息介绍。</p>
        <p>
          1.2&nbsp;标的债权的相关情况，见下表标的债权信息中的介绍。
          标的债权即指资金借入方应当支付但尚未向债权转让方支付的剩余本息（含违约金，如有）总额。
        </p>
        <table className="tb-two">
          <tbody>
            <tr>
              <td>
                借款编号
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                债务人（即资金借入方）姓名
              </td>
              <td></td>
              <td>吾悠用户名</td>
              <td></td>
            </tr>
            <tr>
              <td>
                债务人身份号码
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                原借款总额
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                原借款年利率
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                原借款期限
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                还款方式
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                原借款起息日
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td>
                原借款期满日
              </td>
              <td colSpan="3"></td>
            </tr>
          </tbody>
        </table>
      </div> */}
      <div>
          <div className="TwoLeve">1.标的债权转让价格</div>
          <p>1.1&nbsp;转让方与受让方同意，自本协议签署之日，对标的债权即上述剩余本金及剩余债权期限内潜在的利息按双方确认的价格进行转让。该双方确认价格是指转让方与受让方通过本网站撮合并经双方认可的价格。</p>
          <p>1.2&nbsp;受让方通过本网站受让债权之前，应保证其在本网站平台账户内有足够资金，否则会导致其无法受让标的债权；受让方通过本网站完成受让债权的操作，即意味着其授权吾悠将其平台账户内资金直接拨付给转让方。</p>
          <p>1.3&nbsp;转让方确认，吾悠经受让方授权向转让方平台账户内拨付转让价款，即为受让方支付转让价款的行为。</p>
          <p>1.4&nbsp;上述转让与受让行为涉及的税费由转让方与受让方按照相关税务法律法规规定承担和处理，吾悠既不承担转让双方的税负也不为转让双方代扣代缴税款。</p>
      </div>
      <div>
        <div className="TwoLeve">2.债权转让流程</div>
        <p>2.1&nbsp;转让双方同意并确认，转让双方通过自行根据本网站有关规则和说明，在本网站进行债权转让和受让操作等方式确认签署本协议。</p>
        <p>2.2&nbsp;本协议生效且转让方收到转让价款的同时，受让方即按照转让方与资金借入方达成的借款协议享有其中资金借出方的权利并承担相应义务，本网站将对该项借贷的资金借出方进行变更。</p>
        <p>2.3&nbsp;本协议生效后，转让双方无须再向资金借入方进行债权转让的通知，但转让方不得再行使对资金借入方的债权，本网站有权将资金借入方的还款拨付给受让方；
        如果转让方收到资金借入方支付的还款时，其亦应主动转给受让方；否则，转让方应赔偿受让方全部损失（包括直接损失和间接损失）。</p>
        <p>2.4&nbsp;转让方在转让债权时，需在收到转让价款的同时向吾悠支付相当于转让债权已收收益总额*    %作为债权转让管理服务费；转让方授权吾悠直接从转让价款中直接扣除该项管理服务费。</p>
      </div>
      <div>
        <div className="TwoLeve">3.保证与承诺</div>
        <div className="ThrLeve">3.1&nbsp;转让方的陈述与保证：</div>
        <p>3.1.1&nbsp;转让方保证其提供的信息和资料均真实、完整、有效。</p>
        <p>3.1.2&nbsp;转让方保证其转让的债权系真实、合法、有效，不存在转让的限制，该债权也不存在被质押（无论是否办理应收账款质押登记）或其上设定其他负担。</p>
        <div className="ThrLeve">4.2.受让方的陈述与保证：</div>
        <p>3.2.1&nbsp;受让方保证其提供的信息和资料均真实、完整、有效，并且受让方进一步保证其不会提供任何虚假信息或隐瞒重要事实。</p>
        <p>3.2.2&nbsp;受让方保证其所用于受让标的债权的资金来源合法，受让方进一步承诺此次资金支付符合法律法规的相关规定，且不存在任何洗钱等违法违规行为。</p>
        <p>
        3.2.3&nbsp;受让方保证所支付的资金属于受让人有权支配的资金，且不存在妨碍受让方参与本次债权转让的情形。如果第三方对资金归属、合法性问题发生争议的，
        由受让方自行解决，与吾悠无关。若因此给吾悠造成损失的，受让方应当赔偿吾悠的一切损失。
        </p>
        <p>3.2.4&nbsp;受让方承诺自本协议生效后，其自愿承担标的债权的清偿风险，不得因不能全部清偿债权而追究转让方或本网站责任、或者要求退回债权。</p>
        <p>3.2.5&nbsp;受让人知悉并确认，转让人对借款人不承担任何保证责任，若借款人未能按期还款的，应当由受让人按照《借款合同》的约定向借款人要求赔偿。</p>
        <div className="ThrLeve">3.3转让方与受让方确认，各自就本协议项下债权或其收益，承担其收益的相应税费。</div>
      </div>
      <div>
        <div className="TwoLeve">4.保密条款</div>
        <p>4.1&nbsp;基于本次转让所获得的包括本合同在内的相关信息或商业约定，任何一方不得向本合同主体及吾悠以外的其他方透露，根据法律法规及有关监管机构要求应当进行披露的，或为债权再转让之目的进行披露的除外。</p>
        <p>4.2&nbsp;各方保证：为履行本合同各自委托的专业机构和人员承担上述保密义务。</p>
        <p>4.3&nbsp;任何一方违反保密义务，守约方有权要求违约方赔偿损失。</p>
      </div>
      <div>
        <div className="TwoLeve">5.违约责任</div>
        <p>
          5.1&nbsp;转让双方同意，如果一方违反其在本协议中所作的保证、承诺或任何其他义务，
          致使其他方遭受或发生损害、损失等责任，违约方须向守约方赔偿守约方因此遭受的一切经济损失，包括直接损失和间接损失。
        </p>
        <p>5.2&nbsp;转让双方均有过错的，应根据转让双方实际过错程度，分别承担各自的违约责任。</p>
      </div>
      <div>
        <div className="TwoLeve">6.适用法律和争议解决</div>
        <p>6.1&nbsp;本协议的订立、效力、解释、履行、修改和终止以及争议的解决适用中国的法律。</p>
        <p>6.2&nbsp;本协议在履行过程中，如发生任何争执或纠纷，双方应友好协商解决；若协商不成，任何一方均有权向吾悠所在地的人民法院提起诉讼。</p>
      </div>
      <div>
        <div className="TwoLeve">7.特别约定：</div>
        <p>
        7.1&nbsp;转让双方在此确认，双方本次债权转让交易相关的所有合同、协议、确认书、通知均可通过电子数据形式呈现，双方对相关互联网页面或电子数据的同意、确认操作即视为合法有效的签署，
        本次债权转让交易所涉及各方主体向转让方送达的通知以电子邮件或短信等电子形式提供即视为合法有效的送达。
        双方确认均已仔细阅读了本合同及附件的条款内容，对本合同及标的债权的所有内容均已充分了解且无异议，并且对本合同项下的有关权利、义务和责任已充分理解。
        </p>
        <p>7.2&nbsp;转让双方同意，作为本次债权转让交易的居间服务及平台提供方，在合同履行过程中出现争议的，吾悠有对本合同相关条款进行合理解释的权利。</p>
        <p>7.3&nbsp;转让方与受让方一致确认，吾悠仅为本合同项下的债权转让交易提供中介服务，并不就本次债权转让交易向任何一方承担任何保证责任或其他担保责任。</p>
        <p>7.4&nbsp;转让方与受让方均同意并确认，受让方通过本网站所采取的任何行为所产生的法律效果和法律责任均分别归属于转让人、受让方；并且转让方、受让方授权和委托吾悠根据本合同所采取的全部行动和措施的法律后果均分别归属于转让方、受让方本人，
        与吾悠无关，吾悠也不因此承担任何责任。</p>
        <p>7.5&nbsp;转让方与受让方确认并同意，一致委托吾悠对本合同项下的金额进行计算并允许通过吾悠发布；在无明显错误的情况下，吾悠对本合同项下金额的证明或计算结果，应作为该金额有关事项的终局证明。</p>
        <p>7.6&nbsp;转让方与受让方确认，自本合同签订之日起，如双方下列信息发生变更的，应当在相关信息发生变更三日内自行负责在本网站完成更新：（1）转让方或受让方为个人的，
        应更新的变更信息范围包括但不限于本人信息、手机号码、电子邮箱、银行账户的变更；（2）转让方或受让方为企业法人或其他组织的，应更的变更信息范围包括但不限于企业名称、企业注册号、法定代表人、注册资本等相关工商登记信息。</p>
      </div>
      <div>
        <div className="TwoLeve">8.其他</div>
        <p>8.1&nbsp;本协议及其修改或补充均通过本网站以电子文本形式制成，且转让双方可登录其在本网站的账户查阅、下载本协议文本。</p>
        <p>8.2&nbsp;转让双方均确认，本协议的签订、生效和履行以不违反中国的法律法规为前提。如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</p>
        <p>8.3&nbsp;除本协议上下文另有定义外，本协议项下的用语和定义应具有本网站服务协议及其有关规则中定义的含义。若有冲突，则以本协议为准。</p>
        <p>8.4&nbsp;除本协议外，转让双方还受本网站注册协议等文件约束本协议项下交易行为。</p>
        <p>8.5&nbsp;转让双方通过本网站确认的《网站注册服务协议》为本协议有效组成部分。</p>
        <div className="TwoLeve">附表：剩余借款及还款计划表</div>
        <table className="tb-thr">
          <tbody>
            <tr>
              <td colSpan="5">
                剩余借款明细
              </td>
            </tr>
            <tr>
              <td colSpan="2">
                转让方
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td colSpan="2">
                受让方
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td colSpan="2">
                债权转让价格
              </td>
              <td colSpan="3">人民币&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;元</td>
            </tr>
            <tr>
              <td colSpan="2">
                债权剩余期限
              </td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td colSpan="2">
                转让手续费
              </td>
              <td colSpan="3">人民币&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;元</td>
            </tr>
            <tr>
              <td colSpan="2">
                转让日期
              </td>
              <td colSpan="3"></td>
            </tr>
          </tbody>
        </table>
      </div>
    </WrapDiv>
  </Page>
);

export default CreditAssignment;
