import styled from 'styled-components';
import Page from '../../components/page';

const WrapDiv = styled.div`
  font-size:12px;
  max-width:1024px;
  padding:20px 12px;
  box-sizing:border-box;
  margin:0 auto;
  color:#666;
  div,p {
    line-height:150%;
  }
  p {
    margin:4px 0;
  }

  table,table tr th, table tr td {
    border:1px solid #ccc;
    border-collapse: collapse;
  }
  table {
    width:100%;
    text-align:center;
    margin:6px 0;
    td {
      padding:6px 10px;
      box-sizing:border-box;
      width: 20%;
    }
    .empty-tr {
      td {
        padding: 16px 0;
      }
    }
    .text-p {
      text-align: left;
    }
  }
  .TitleH {
    font-size:24px;
    font-weight:bold;
    color:#333;
    text-align:center;
  }
  .OneLeve {
    font-size:20px;
  }
  .TwoLeve {
    font-size:16px;
    color:#333;
    font-weight:bold;
    padding:8px 0;
  }
  .ThrLeve {
    font-size:14px;
    color:#333;
    font-weight:bold;
    padding:4px 0;
  }
  .IndentP {
    text-indent:24px;
  }
`;


const Loan =()=>(
  <Page title="借款协议">
    <WrapDiv>
      <div className="TitleH">借款协议</div>
      <div>
        <p>本借款协议（下称“本协议”）由以下各方于上海市普陀区签署：</p>
        <p>借款人：__________________________________</p>
        <p>注册号：__________________________________</p>
        <p>投资人：__________________________________</p>
        <p>身份证号/用户ID：__________________________</p>
        <p>居间人：上海吾悠互联网科技服务有限公司</p>
        <p>住所地：上海市普陀区金沙江路2145号A座7楼</p>
        <p>鉴于：</p>
        <p className="IndentP">1、居间人系在上海市合法成立并有效存续的有限责任公司，拥有“领投鸟”(下称本平台，均指领投鸟网站、APP平台及上海吾悠互联网科技服务有限公司)的经营权，能有效提供投、融资居间、管理服务；</p>
        <p className="IndentP">2、借款人通过本平台向投资人借款，并通过本平台及与本平台合作的第三方支付机构完成投资行为，双方根据平等自愿的原则，达成本协议，以期共同遵守：</p>
      </div>
      <div>
        <div className="TwoLeve">第一条：定义（除非缔约方另有约定，下列用语具有以下含义）</div>
        <p>1、投资计划(下称本计划)：指居间人根据投资人的委托，对合作机构推荐的借款项目产品（包括但不限于不动产、消费分期、供应链融资项目等）进行严格审核后，协助投资人将资金出借给借款人的投资计划。</p>
        <p>2、第三方支付机构：指在本协议各方之间提供资金转移服务的银行或第三方支付结算机构。</p>
        <p>3、预约购买：指通过预订的模式，优先匹配预约资金，并达成实际购买的行为。</p>
      </div>
      <div>
        <div className="TwoLeve">借款计划内容</div>
        <table>
          <tbody>
            <tr>
              <td colSpan="5">借款人信息</td>
            </tr>
            <tr>
              <td colSpan="2">名称</td>
              <td colSpan="3">计划借款总额</td>
            </tr>
            <tr className="empty-tr">
              <td colSpan="2"></td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td colSpan="5">借款明细</td>
            </tr>
            <tr>
              <td>借款金额</td>
              <td>借款期限</td>
              <td>历史年化收益</td>
              <td>出借日期</td>
              <td>到期日期</td>
            </tr>
            <tr className="empty-tr">
              <td></td>
              <td></td>
              <td></td>
              <td></td>
              <td></td>
            </tr>
            <tr>
              <td colSpan="5">收益明细</td>
            </tr>
            <tr>
              <td colSpan="2">到期应收本息</td>
              <td colSpan="3"></td>
            </tr>
            <tr>
              <td colSpan="5" className="text-p">
                备注：<br/>
                1、借款利率的折算：日收益率=年化收益率/365，月收益率=年化收益率/12<br/>
                2、出借日期：居间人授权第三方支付机构操作转款至借款人指定账户之次日<br/>
                3、起息日期：见项目介绍
              </td>
            </tr>
          </tbody>
        </table>
      </div>
      <div>
        <div className="TwoLeve">第三条：投资人的权利义务</div>
        <p>1、投资人通过本平台成功预约购买本平台发布的理财产品的，本平台可优先匹配其预约资金，并形成对相关借款项目（以本平台实际公布的理财产品名称为准，下称本标的）的实际购买，投资人不得再撤回出借款项。</p>
        <p>2、投资人保证其所用于投资的资金来源合法，如有第三人对资金合法性问题产生争议的，由投资人自行解决并承担一切后果；投资人也具有相应的风险识别与承受能力，并自愿承担交易风险。</p>
        <p>3、投资人享有其投资所带来的投资收益，并应根据国家法律规定自行缴纳由利息所得带来的可能的税费。</p>
      </div>
      <div>
        <div className="TwoLeve">第四条：借款人的权利义务</div>
        <p>1、借款人应于本协议约定的每月还款日支付应付收益。于最后一期还款日将本金和剩余应付收益一次性通过本平台及本平台合作的第三方支付机构归还至投资人账户，遇还款日为法定节假日或公休日的则顺延至下一个工作日。 </p>
        <p>2、借款人保证严格按本协议约定的期限偿还当期应还款金额、并支付其它各项费用。同时借款人委托资产端业务公司为投资人提供连带担保，并最终达成资产端业务公司就借款人对投资人的借款发生逾期或违约支付时兑付本息的协议。</p>
        <p>3、借款人未足额支付应付款项的，则视为逾期。借款人同意在其违约的情形下，居间人有权依投资人要求向投资人提供已获得的借款人信息。</p>
      </div>
      <div>
        <div className="TwoLeve">第五条：居间人的权利义务</div>
        <p>
          1、居间人根据借款人、投资人的授权，通过本平台，为双方提供投资对接、资金监管等服务。
          居间人保留向借款人/投资人收取服务费的权利，一旦本平台确定收取或调整服务收取方式及标准，将以在本平台发布公告的方式通知借款人/投资人，而不再作个别通知。
        </p>
        <p>2、居间人有权根据借款人提供的标的信息及居间人独立获得的信息对借款人的信用进行评估，自主决定是否审核通过并将借款人的资金需求向投资人进行推荐。</p>
        <p>3、居间人有权代投资人管理及监督借款人对借款的使用情况；有权催收到期或已逾期垫付的本金、利息、违约金，及由担保人履行担保代偿义务发生的费用等相关费用。</p>
        <p>4、居间人凭投资人委托或授权发放借款；凭借款人委托或授权代收还款，利息等。</p>
      </div>
      <div>
        <div className="TwoLeve">第六条：授权</div>
        <p>1、投资人知晓并同意居间人向第三方支付机构发出指令通过本平台将借款款项从其在本平台的账户中划付到借款人在本平台开立的账户中，并根据本协议代投资人按前述路径回收本金与收益。</p>
        <p>2、投资人同意并授权居间人采取包括但不限于通过站内信、电子邮件、平台公示等方式进行通知、公告。</p>
      </div>
      <div>
        <div className="TwoLeve">第七条：违约处理</div>
        <p>
          1、若借款人未依照本协议约定时间向投资人偿还借款本金及收益，则居间人可宣布本合同项下的借款本息全部加速提前到期，
          并要求借款人提前清偿所有借款本金、收益以及逾期违约金。借款人应按照未还款金额（包括本金和收益）以每日1.5‰的标准向投资人支付逾期违约金。
        </p>
        <p>
          2、借款人违约致使居间人或担保人决定通过其他途径采取补救或追偿措施的，
          由此引起的一切费用均由借款人承担（包括但不限于诉讼/仲裁费用、律师代理费用、评估费、保全费、担保费、交通费、差旅费、调查费及其他实现债权所产生的费用等）。
        </p>
      </div>
      <div>
        <div className="TwoLeve">第八条：适用法律和争议解决</div>
        <p>1、本协议的订立、效力、解释、履行、修改和终止以及争议的解决适用中国的法律。</p>
        <p>2、本协议在履行过程中，如发生任何争执或纠纷，双方应友好协商解决；若协商不成，任何一方均有权向本协议签订地的人民法院提起诉讼。</p>
      </div>
      <div>
        <div className="TwoLeve">第九条：其他</div>
        <p>1、本协议采用电子文本形式制成，投资人和借款人在本平台注册且完成操作即视为同意本协议全部内容。各方均认可本协议效力及本协议内容。</p>
        <p>2、如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</p>
        <p>3、本协议项下无约定的事项以本平台公布的相关规则为准。</p>
        <p>声明：对于本协议条款，本平台已应投资人、借款人要求进行充分解释及说明，投资人、借款人对本协议内容及相应风险已完全知悉并理解。</p>
      </div>
    </WrapDiv>
  </Page>
)

export default Loan;
